In [1]:
import mysql.connector

In [2]:
mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="SQLG123"
)

In [3]:
mycursor = mydb.cursor()

mycursor.execute("SHOW DATABASES")

for x in mycursor:
  print(x)

('company',)
('db1',)
('information_schema',)
('mysql',)
('performance_schema',)
('sakila',)
('sys',)
('world',)
('zomato',)
('zomatos',)

In [4]:
import pandas as pd

In [5]:
mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="SQLG123",
  database="sakila"
)

In [6]:
mycursor = mydb.cursor()

mycursor.execute("SHOW TABLES")

for x in mycursor:
  print(x)

('actor',)
('actor_info',)
('address',)
('category',)
('city',)
('country',)
('customer',)
('customer_list',)
('film',)
('film_actor',)
('film_category',)
('film_list',)
('film_text',)
('inventory',)
('language',)
('nicer_but_slower_film_list',)
('payment',)
('rental',)
('sales_by_film_category',)
('sales_by_store',)
('staff',)
('staff_list',)
('store',)

In [9]:
for x in mycursor:
  print(x)

In [11]:
mycursor.execute("CREATE TABLE customers (id INT PRIMARY KEY, name VARCHAR(255), address VARCHAR(255))")

In [12]:
sql = "INSERT INTO customerss (id, name, address) VALUES (%s, %s,%s)"
val = (1,"John", "Highway 21")
mycursor.execute(sql, val)

mydb.commit()

print(mycursor.rowcount, "record inserted.")

1 record inserted.

In [13]:
mycursor = mydb.cursor()

sql = "INSERT INTO customerss (id, name, address) VALUES (%s, %s, %s)"
val = [
  (2,'Peter', 'Lowstreet 4'),
  (3,'Amy', 'Apple st 652'),
  (4,'Hannah', 'Mountain 21'),
  (5,'Michael', 'Valley 345'),
  (6,'Sandy', 'Ocean blvd 2')
]

mycursor.executemany(sql, val)

mydb.commit()

In [14]:
print(mycursor.rowcount, "record inserted.")

5 record inserted.

In [15]:
mycursor.execute("SELECT * FROM customerss")

myresult = mycursor.fetchall()

for x in myresult:
  print(x)

(1, 'John', 'Highway 21')
(2, 'Peter', 'Lowstreet 4')
(3, 'Amy', 'Apple st 652')
(4, 'Hannah', 'Mountain 21')
(5, 'Michael', 'Valley 345')
(6, 'Sandy', 'Ocean blvd 2')

In [16]:
mycursor.execute("SELECT * FROM customerss")

for x in myresult:
  print(x)

(1, 'John', 'Highway 21')
(2, 'Peter', 'Lowstreet 4')
(3, 'Amy', 'Apple st 652')
(4, 'Hannah', 'Mountain 21')
(5, 'Michael', 'Valley 345')
(6, 'Sandy', 'Ocean blvd 2')

In [17]:
myresult = mycursor.fetchall()

In [18]:
for x in myresult:
  print(x)

(1, 'John', 'Highway 21')
(2, 'Peter', 'Lowstreet 4')
(3, 'Amy', 'Apple st 652')
(4, 'Hannah', 'Mountain 21')
(5, 'Michael', 'Valley 345')
(6, 'Sandy', 'Ocean blvd 2')

In [19]:
##mycursor = mydb.cursor()
##myresult = mycursor.fetchone()
##for x in myresult:
##  print(x)

In [20]:
mycursor = mydb.cursor()

sql = "SELECT * FROM customers WHERE address ='Apple st 652'"

mycursor.execute(sql)

myresult = mycursor.fetchall()

for x in myresult:
  print(x)

In [21]:
sql = "SELECT * FROM customers WHERE address LIKE '%way%'"

mycursor.execute(sql)

myresult = mycursor.fetchall()

for x in myresult:
  print(x)

In [22]:
mycursor = mydb.cursor()

sql = "SELECT * FROM customers ORDER BY name"

mycursor.execute(sql)

myresult = mycursor.fetchall()

for x in myresult:
  print(x)

In [23]:
mycursor = mydb.cursor()

sql = "UPDATE customers SET address = 'Canyon 123' WHERE address = 'Valley 345'"

mycursor.execute(sql)

mydb.commit()

print(mycursor.rowcount, "record(s) affected")

0 record(s) affected

In [24]:
mycursor = mydb.cursor()

sql = "DELETE FROM customers WHERE address = 'Mountain 21'"

mycursor.execute(sql)

mydb.commit()

##print(mycursor.rowcount, "record(s) deleted")